Table of Contents
 Class BimLinkObject
Namespace
IdeaStatiCa.BimApiLink
Assembly
IdeaStatiCa.BimApiLink.dll
public class BimLinkObject : ScopeAwareObject
Inheritance
object
ScopeAwareObject
BimLinkObject
Derived
AbstractIdeaObject<T>
IdeaModel
AbstractImporter<T>
InternalForcesBuilder<T>
Inherited Members
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 CountryCode
protected CountryCode CountryCode { get; }
Property Value
CountryCode
 UserData
protected object UserData { get; }
Property Value
object
Methods
 GetMaybe<T>(Identifier<T>)
protected T GetMaybe<T>(Identifier<T> identifier) where T : IIdeaObject
Parameters
identifier Identifier<T>
Returns
T
Type Parameters
T
 GetMaybe<T>(int)
protected T GetMaybe<T>(int id) where T : IIdeaObject
Parameters
id int
Returns
T
Type Parameters
T
 GetMaybe<T>(string)
protected T GetMaybe<T>(string id) where T : IIdeaObject
Parameters
id string
Returns
T
Type Parameters
T
 Get<T>(Identifier<T>)
protected T Get<T>(Identifier<T> identifier) where T : IIdeaObject
Parameters
identifier Identifier<T>
Returns
T
Type Parameters
T
 Get<T>(int)
protected T Get<T>(int id) where T : IIdeaObject
Parameters
id int
Returns
T
Type Parameters
T
 Get<T>(string)
protected T Get<T>(string id) where T : IIdeaObject
Parameters
id string
Returns
T
Type Parameters
T
 Edit this page